[{"link": "https://pdfs.semanticscholar.org/f1d3/a3afcef3a9989e605188db96bf52f1482101.pdf", "title": "Looking into the Operational Modalities Adopted in Some of the POS Tagging Tools in Identification of Contextual Part-of-Speech of Words in Texts", "authors": [{"firstName": "Kesavan", "middleNames": ["Vadakalur"], "lastName": "Elumalai"}, {"firstName": "N.", "middleNames": [], "lastName": "Das"}, {"firstName": "Mufleh", "middleNames": ["Salem", "M."], "lastName": "Alqahtani"}, {"firstName": "Anas", "middleNames": [], "lastName": "Maktabi"}], "abstract": "Part-of-speech (POS) tagging is an indispensable method of text processing. The main aim is to assign part-of-speech to words after considering their actual contextual syntactic-cum-semantic roles in a piece of text where they occur (Siemund & Claridge 1997). This is a useful strategy in language processing, language technology, machine learning, machine translation, and computational linguistics as it generates a kind of output that enables a system to work with natural language texts with greater accuracy and success. Part-of-speech tagging is also known as ‘grammatical annotation’ and ‘word category disambiguation’ in some area of linguistics where analysis of form and function of words are important avenues for better comprehension and application of texts. Since the primary task of POS tagging involves a process of assigning a tag to each word, manually or automatically, in a piece of natural language text, it has to pay adequate attention to the contexts where words are used. This is a tough challenge for a system as it normally fails to know how word carries specific linguistic information in a text and what kind of larger syntactic frames it requires for its operation. The present paper takes up this issue into consideration and tries to critically explore how some of the well-known POS tagging systems are capable of handling this kind of challenge and if these POS tagging systems are at all successful in assigning appropriate POS tags to words without accessing information from extratextual domains. The novelty of the paper lies in its attempt for looking into some of the POS tagging schemes proposed so far to see if the systems are actually successful in dealing with the complexities involved in tagging words in texts. It also checks if the performance of these systems is better than manual POS tagging and verifies if information and insights gathered from such enterprises are at all useful for enhancing our understanding about identity and function of words used in texts. All these are addressed in this paper with reference to some of the POS taggers available to us. Moreover, the paper tries to see how a POS tagged text is useful in various applications thereby creating a sense of awareness about multifunctionality of tagged texts among language users.", "date": "2019-11-30"}, {"link": "https://doi.org/10.1111/bjet.12875", "title": "Exploring the potential of natural language processing to support microgenetic analysis of collaborative learning discussions", "authors": [{"firstName": "F.", "middleNames": [], "lastName": "Sullivan"}, {"firstName": "P.", "middleNames": ["K."], "lastName": "Keith"}], "abstract": "In this study, we explore the potential of a natural language processing (NLP) approach to support discourse analysis of in‐situ, small group learning conversations. The theoretical basis of this work derives from Bakhtin's notion of speech genres as bounded by educational robotics activity. Our goal is to leverage computational linguistics methods to advance and improve educational research methods. We used a parts‐of‐speech (POS) tagging program to automatically parse a transcript of spoken dialogue collected from a small group of middle school students involved in solving a robotics challenge. We grammatically parsed the dialogue at the level of the trigram. Then, through a deliberative process, we mapped the POS trigrams to our theoretically derived problem solving in computational environments coding system. Next, we developed a stacked histogram visualization to identify rich interactional segments in the data. Seven segments of the transcript were thus identified for closer analysis. Our NLP‐based approach partially replicated prior findings. Here, we present the theoretical basis for the work, our analytical approach in exploring this NLP‐based method, and our research findings. Practitioner NotesWhat is already known about this topic Over the last 10 years, several educational research papers indicate that natural language processing (NLP) techniques can be used to help interpret well‐structured, written dialogue, eg, conversations in online class discussions.Two recent papers indicate that NLP techniques can also be used to help interpret well‐structured, spoken dialogue, eg, replies to interview questions and/or comments made during think aloud protocols.Multimodal learning analytic techniques are being used to investigate collaborative learning. These studies use non‐verbal features of data (gaze, gesture, physical actions), prosodic features of verbal data (pitch and tone) and/or turn‐taking and duration of talk per speaker data, as means of predicting group success. None of the MMLA studies attempt semantic analysis of student talk in collaborative settings.What this paper adds A theoretical framework for why and how an automated NLP approach can support discourse analysis research on co‐located, computer‐based, collaborative problem solving interactions. This framework, entitled the Problem Solving in Computational Environment Speech Genre, links children's physical interactions with computational devices to their verbal exchanges and presents a theoretical rationale for the use of NLP methods in educational research.Description of an interdisciplinary method that combines NLP techniques with qualitative coding approaches to support analysis of student collaborative learning with educational robotics.Identification of student learning outcomes derived from the semantic, PSCE Speech Genre and NLP approach.Implications for practice and/or policy Educational researchers will be able to expand upon our findings towards the goal of using computation and automation to support microgenetic analysis of large datasets.Robust microgenetic learning findings will provide curriculum developers, educational technology developers and teachers with guidance on how to construct and or create learning materials and environments.From an interdisciplinary perspective, this research can support more interdisciplinary exploration of conversational dialogues that are ill‐structured, indexical and referential. This research will support the further development of machine learning techniques and neural network models by computational linguists. [ABSTRACT FROM AUTHOR]", "date": "2019-08-26"}, {"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7377666", "title": "RESTFul POS tagging WEB service for Sinhala language", "authors": [{"firstName": "A.", "middleNames": [], "lastName": "Jayaweera"}, {"firstName": "N.", "middleNames": [], "lastName": "Dias"}], "abstract": "In the present context of human computer interaction, world has achieved tremendous progress in the field of Natural Language Processing (NLP) applications. The availability of lexical resources is vital to many natural language processing in the field of computation linguistics. But only few languages in the world have the advantage of having enough lexical resources. Though Sinhala language has a long history, Natural Language Processing and computational linguistic aided development of the language is far behind compared with other languages. Researches on NLP for Sinhala language can be pushed by creation of required lexical resources and tools. In this paper we present our research work that was carried out for contributing to NLP based development of the language by developing a part of speech tagger for Sinhala language. The tagger we developed shows over 91% of an accuracy, and the tagger is available as RESTFul web service on the Internet that is freely accessible to the public.", "date": "2015-08-01"}, {"link": "https://www.aclweb.org/anthology/Q17-1033.pdf", "title": "Replicability Analysis for Natural Language Processing: Testing Significance with Multiple Datasets", "authors": [{"firstName": "Rotem", "middleNames": [], "lastName": "Dror"}, {"firstName": "G.", "middleNames": [], "lastName": "Baumer"}, {"firstName": "M.", "middleNames": [], "lastName": "Bogomolov"}, {"firstName": "Roi", "middleNames": [], "lastName": "Reichart"}], "abstract": "With the ever growing amount of textual data from a large variety of languages, domains, and genres, it has become standard to evaluate NLP algorithms on multiple datasets in order to ensure a consistent performance across heterogeneous setups. However, such multiple comparisons pose significant challenges to traditional statistical analysis methods in NLP and can lead to erroneous conclusions. In this paper we propose a Replicability Analysis framework for a statistically sound analysis of multiple comparisons between algorithms for NLP tasks. We discuss the theoretical advantages of this framework over the current, statistically unjustified, practice in the NLP literature, and demonstrate its empirical value across four applications: multi-domain dependency parsing, multilingual POS tagging, cross-domain sentiment classification and word similarity prediction.", "date": "2017-09-27"}, {"title": "UNKNOWN WORDS ANALYSIS IN POS TAGGING OF SINHALA LANGUAGE", "authors": [{"firstName": "Sri", "middleNames": [], "lastName": "Lanka"}], "abstract": "Part of Speech (POS) is a very vital topic in Natural Language Processing (NLP) task in any language, which involves analysing the construction of the language, behaviours and the dynamics of the language, the knowledge that could be utilized in computational linguistics analysis and automation applications. In this context, dealing with unknown words (words do not appear in the lexicon referred as unknown words) is also an important task, since growing NLP systems are used in more and more new applications. One aid of predicting lexical categories of unknown words is the use of syntactical knowledge of the language. The distinction between open class words and closed class words together with syntactical features of the language used in this research to predict lexical categories of unknown words in the tagging process. An experiment is performed to investigate the ability of the approach to parse unknown words using syntactical knowledge without human intervention. This experiment shows that the performance of the tagging process is enhanced when word class distinction is used together with syntactic rules to parse sentences containing unknown words in Sinhala language."}]