[{"link": "https://doi.org/10.3366/COUNT.2017.0074", "title": "Relocating the Literary: In Networks, Knowledge Bases, Global Systems, Material, and Mental Environments", "authors": [{"firstName": "", "middleNames": [], "lastName": "TabbiJoseph"}], "abstract": "The cosmopolitan ideal of a world literature, only partially and occasionally realised in print, can give us terms with which to measure the costs and benefits of moving scholarly works, and our conversations about works, into present media. This essay takes a measuredly optimistic view of our current potential, as literature moves not simply from print to screen, across national borders, or among avant-garde aesthetics. The defining move, I want to argue, is from bounded forms to the database, whose works, while stable, remain open to linkages with all other literary forms available in any number of interoperable databases. The relocation of works in new media is a shift not in degree, but in kind. As our expectations too shift regarding the means of circulation among minds and media, we are more likely to discern what is really new and really global about writing in the media ecology and cognitive economies we currently inhabit.", "date": "2017-05-04"}, {"title": "Descubrimiento de conocimiento en bases de datos históricas de una empresa comercializadora/Knowledge discovery in databases historical of a trading company", "authors": [{"firstName": "Tania", "middleNames": [], "lastName": "Morgado-García"}, {"firstName": "Daniel", "middleNames": ["Antonio"], "lastName": "Ponce-de-León-Lima"}, {"firstName": "A.", "middleNames": [], "lastName": "Rosete-Suárez"}], "abstract": "Con el desarrollo de las tecnologias, el volumen ingente de las bases de datos y la necesidad de obtener conocimiento util de ellas, la mineria de datos se convierte en una herramienta estrategica para las empresas, como soporte a la toma de decisiones.Una empresa cubana creada en el ano 1991, cuyo nombre no se menciona por razones de confidencialidad, la cual se distingue por ser un proveedor de soluciones integrales, ofrece productos y servicios ingenieros en una variada gama de esferascontando con un personal altamente capacitado. Posee grandes volumenes de datos resultantes de la gestion de cada una de sus unidades organizativas, pero no se realizan analisis para identificar patrones y comportamientos ocultos en los datos.En este trabajo se desarrollo un proceso de Descubrimiento de Conocimiento en Bases de Datos en la mencionada empresa como ayuda a la toma de decisiones. En este sentido, se detallaron aspectos relacionados con la Mineria de Datos y su aplicacion en el entorno de los indicadores economicos-financieros y de gestion, se obtuvieron modelos de asociacion y agrupamiento que permitiran apoyar el trabajo de los directivos en los diferentes niveles de la organizacion. Abstract With the development of technologies, the big volume of databases and the need to obtain useful knowledge of them, data mining becomes a strategic tool for companies, which support the decision making. A cuban company, created in 1991, whose name is not mentioned for reasons of confidentiality, which is distinguished as a provider of comprehensive solutions, offers products and engineering services in a wide range of areas with a highly trained staff. It has large volumes of data resulting from the management of each of its organizational units, but no analysis are done to identify hidden patterns and behaviors in data.This paper present a process of Knowledge Discovery in Databases in the aforementioned company as an aid to decision making. In this regard, aspects related to data mining and its application in the environment of economic-financial indicators and management were detailed, association and clustering models that will support the work of managers at different levels of the organization were obtained.", "date": "2017-10-16"}, {"title": "Grafos de conocimiento y bases de datos en grafo: conceptos fundamentales a partir de una “obra maestra” del Museo del Prado", "authors": [{"firstName": "T.", "middleNames": [], "lastName": "Pérez"}], "abstract": "espanolSe presentan los conceptos basicos sobre bases de datos en grafo y grafos de conocimiento, a partir del estudio de caso del modelo semantico digital del Museo del Prado, y el impacto en el rediseno de su sitio web, centrado en el acceso enriquecido a su coleccion y recursos vinculados, y metadatos para el descubrimiento de contenidos. EnglishThe basic concepts of graph databases and knowledge graphs are presented, based on the case study of the digital semantic model of the Museo del Prado, and the impact on the redesign of its website, focused on the enriched access to its collection and linked resources, and metadata for content discovery."}, {"link": "https://doi.org/10.18848/1833-1882%2Fcgp%2Fv02i05%2F52432", "title": "Danto’s Recipe for Clio: Leveraging Narrativist Insights for Modeling Historiography in Symbolic Knowledge Bases", "authors": [{"firstName": "R.", "middleNames": [], "lastName": "Kahlert"}], "abstract": ""}, {"title": "LAS BASES CIENTÍFICAS DEL SABER MÉDICO DE GALDÓS / THE SCIENTIFIC BASES OF THE MEDICINE KNOWLEDGE OF GALDÓS", "authors": [{"firstName": "M.", "middleNames": [], "lastName": "Stannard"}], "abstract": "En el contexto de la indagacion sobre la relacion de Galdos con la ciencia de su tiempo y, en este caso concreto, con la ciencia medica, este trabajo plantea como primer interrogante el del como de los conocimientos amplios que Galdos demostro tener sobre temas medicos en novelas como Lo prohibido , Fortunata y Jacinta o La de Bringas , por ejemplo: su amistad con medicos muy interesantes es una posible respuesta, pero tambien su saber ‘estar al dia’ con la mentalidad de los pensadores sociales de su epoca respecto a la importancia social (y no solo medica) de enfermedades tan extendidas y graves como la tuberculosis, el alcoholismo, la locura o la sifilis. Un analisis pormenorizado sobre el perfil de Maximiliano Rubin, en Fortunata y Jacinta , es valido para concluir que Galdos, previamente, se habia preparado extensamente sobre la sifilis congenita; y que con un retrato tan completo y concreto no solo respondio a una intencion naturalista inicial, sino que ponia ante los lectores un espejo didactico intencionado pintado de de macabrismo y tristeza. In the context of the investigation in the relationship of Galdos with the science of his time and, in this specific case, with the medical science, this work poses as first question of the how of the broad knowledge that Galdos demonstrated have in medical subjects in novels such as Lo prohibido , Fortunata y Jacinta or La de Bringas , for example: his friendship with very interesting doctors is a possible answer, but also his knowledge to ‘keep up’ with the mentality of social thinkers of his time regarding to the social importance (and not only medical) of disease so widespread and serious as tuberculosis, alcoholism, madness or syphilis. An detailed analysis of the profile of Maximiliano Rubin, in Fortunata y Jacinta , is valid to conclude that Galdos had previously prepared extensively on congenital syphilis; and that with a portrait so full and concrete not only responded to an initial naturalistic intention, but it put a painted intentional teaching mirror to readers of macabrism and sorrow."}]