[{"link": "https://pdfs.semanticscholar.org/e722/3cc50e60729fee89f1d56b352f7712b48778.pdf", "title": "Knowledge Extraction from Domain-Specific Documents", "authors": [{"firstName": "R.", "middleNames": [], "lastName": "Kumar"}, {"firstName": "S.", "middleNames": [], "lastName": "Jaloree"}, {"firstName": "R.", "middleNames": ["S."], "lastName": "Thakur"}], "abstract": "Knowledge-based systems have become widespread in modern years. Knowledge-base developers need to be able to share and reuse knowledge bases that they build. As a result, interoperability among different knowledge-representation systems is essential. Domain ontology seeks to reduce conceptual and terminological confusion among users who need to share various kind of information. This paper shows how these structures make it possible to bridge the gap between standard objects and Knowledge-based Systems."}, {"title": "?? ?? ?? ????? ????? ??? ?? ? ???? ( Web Information Extraction for Expanding Knowledge Base of a Specific Domain Information Agent )", "authors": [{"firstName": "", "middleNames": [], "lastName": "조은휘"}, {"firstName": "", "middleNames": [], "lastName": "변영태"}], "abstract": "", "date": "2002-11-01"}, {"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=9011243", "title": "Domain Specific Fusion of Unstructured Text for Situation Understanding (Poster)", "authors": [{"firstName": "Éric-Olivier", "middleNames": [], "lastName": "Bossé"}, {"firstName": "Julian", "middleNames": [], "lastName": "Falardeau"}, {"firstName": "I.", "middleNames": [], "lastName": "Prévost"}, {"firstName": "E.", "middleNames": [], "lastName": "Shahbazian"}, {"firstName": "Olivier", "middleNames": [], "lastName": "Labonté"}], "abstract": "This paper presents the initial design and the current and envisaged functionalities of a novel tool for information extraction and reasoning from open source data (OSD), namely, the Open Source Information Collection, Analysis and Reasoning (OSCAR). It has the ability to ingest and process vast amount of OSD to provide situation understanding and decision support about domain specific situations. The data are pre-filtered using a custom created knowledge base (KB) while the information is extracted using the Rule Based Information Extraction (RuBIE), a Natural Language Processing (NLP) and tagging tool. The extracted information is subsequently clustered and transformed into a relation graph of entities of interest. This proof of concept is presented in the context of a use case based on the social crisis in Venezuela in 2019.", "date": "2019-07-01"}, {"link": "http://dl.acm.org/citation.cfm?id=2964287", "title": "Event Specific Multimodal Pattern Mining for Knowledge Base Construction", "authors": [{"firstName": "Hongzhi", "middleNames": [], "lastName": "Li"}, {"firstName": "Joseph", "middleNames": ["G."], "lastName": "Ellis"}, {"firstName": "Heng", "middleNames": [], "lastName": "Ji"}, {"firstName": "S.", "middleNames": [], "lastName": "Chang"}], "abstract": "Knowledge bases, which consist of a collection of entities, attributes, and the relations between them are widely used and important for many information retrieval tasks. Knowledge base schemas are often constructed manually using experts with specific domain knowledge for the field of interest. Once the knowledge base is generated then many tasks such as automatic content extraction and knowledge base population can be performed, which have so far been robustly studied by the Natural Language Processing community. However, the current approaches ignore visual information that could be used to build or populate these structured ontologies. Preliminary work on visual knowledge base construction only explores limited basic objects and scene relations. In this paper, we propose a novel multimodal pattern mining approach towards constructing a high-level \"event\" schema semi-automatically, which has the capability to extend text only methods for schema construction. We utilize a large unconstrained corpus of weakly-supervised image-caption pairs related to high-level events such as \"attack\" and \"demonstration\" to both discover visual aspects of an event, and name these visual components automatically. We compare our method with several state-of-the-art visual pattern mining approaches and demonstrate that our proposed method can achieve dramatic improvements in terms of the number of concepts discovered (33% gain), semantic consistence of visual patterns (52% gain), and correctness of pattern naming (150% gain).", "date": "2016-10-01"}, {"link": "http://www.lrec-conf.org/proceedings/lrec2012/pdf/570_Paper.pdf", "title": "DBpedia: A Multilingual Cross-domain Knowledge Base", "authors": [{"firstName": "Pablo", "middleNames": ["N."], "lastName": "Mendes"}, {"firstName": "Max", "middleNames": [], "lastName": "Jakob"}, {"firstName": "C.", "middleNames": [], "lastName": "Bizer"}], "abstract": "The DBpedia project extracts structured information from Wikipedia editions in 97 different languages and combines this information into a large multi-lingual knowledge base covering many specific domains and general world knowledge. The knowledge base contains textual descriptions (titles and abstracts) of concepts in up to 97 languages. It also contains structured knowledge that has been extracted from the infobox systems of Wikipedias in 15 different languages and is mapped onto a single consistent ontology by a community effort. The knowledge base can be queried using the SPARQL query language and all its data sets are freely available for download. In this paper, we describe the general DBpedia knowledge base and as well as the DBpedia data sets that specifically aim at supporting computational linguistics tasks. These task include Entity Linking, Word Sense Disambiguation, Question Answering, Slot Filling and Relationship Extraction. These use cases are outlined, pointing at added value that the structured data of DBpedia provides.", "date": "2012-05-01"}]