[{"link": "https://doi.org/10.1016/j.displa.2019.08.007", "title": "Effect of virtual reality and whole-body heating on motion sickness severity: A combined and individual stressors approach", "authors": [{"firstName": "J.", "middleNames": [], "lastName": "Arnold"}, {"firstName": "K.", "middleNames": [], "lastName": "O’Keeffe"}, {"firstName": "Chloe", "middleNames": [], "lastName": "McDaniel"}, {"firstName": "Simon", "middleNames": [], "lastName": "Hodder"}, {"firstName": "Alex", "middleNames": ["B"], "lastName": "Lloyd"}], "abstract": "BackgroundVirtual reality (VR) use is limited by the potential side effects of prolonged exposure to vection, leading to motion sickness. Air temperature (Ta) may exacerbate the severity of such side effects through a synergistic interaction. This study assessed the individual and combined impact of a hot Ta and VR on motion sickness severity.MethodThirteen healthy volunteers were exposed to a 20 min visual stimulus, across four experimental conditions: N_CS: 22°C Ta with computer screen; N_VR: 22°C Ta with VR; H_CS: 35°C Ta with computer screen; H_VR: 35°C Ta with VR. Motion sickness was assessed via fast motion sickness scale (FMS) and simulator sickness questionnaire (SSQ). Physiological indices of motion sickness including, sweat rate, rectal temperature, cutaneous vascular conductance (CVC), skin temperature, blood pressure and heart rate were also examined.ResultsFMS and SSQ ratings indicate a significant main effect for VR, increasing sickness severity (p<0.001). A significant main effect of Ta was observed for SSQ, but not FMS ratings (FMS, p=0.07; SSQ, p<0.04). Despite trends towards synergism, no interaction (Ta x VR) was observed for FMS (p=0.2) or SSQ scores (p=0.07), indicating an additive response. Synergistic trends were also observed for sweat rate and CVC.ConclusionSynergism between VR and heat on motion sickness remains unclear, possibly as a result of considerable inter-individual variation in the reported subjective responses. Understanding of the questions raised by this study inform safe working guidelines for the use of VR in commercial and occupational settings.", "date": "2019-12-01"}, {"title": "Changes in Cardio-Respiratory Function, Heart Rate Variability, and Electrogastrogram Preceding Motion Sickness-Like Symptoms Induced by Virtual Reality Stimulus", "authors": [{"firstName": "老沼", "middleNames": [], "lastName": "みゆ紀"}, {"firstName": "K.", "middleNames": [], "lastName": "Hirayanagi"}, {"firstName": "K.", "middleNames": [], "lastName": "Yajima"}, {"firstName": "Makoto", "middleNames": [], "lastName": "Igarashi"}, {"firstName": "Y.", "middleNames": [], "lastName": "Arakawa"}], "abstract": "", "date": "2004-09-01"}, {"link": "https://doi.org/10.1007/s10484-014-9265-6", "title": "Use of Controlled Diaphragmatic Breathing for the Management of Motion Sickness in a Virtual Reality Environment", "authors": [{"firstName": "M.", "middleNames": ["E.", "B."], "lastName": "Russell"}, {"firstName": "Brittney", "middleNames": [], "lastName": "Hoffman"}, {"firstName": "S.", "middleNames": [], "lastName": "Stromberg"}, {"firstName": "C.", "middleNames": [], "lastName": "Carlson"}], "abstract": "Evidence indicates that activation of the parasympathetic nervous system (PNS) suppresses physiological responses associated with motion sickness. Research also shows paced breathing increases PNS activation; the current study examines the use of paced diaphragmatic breathing (DB) training to quell motion sickness symptoms. Healthy participants (N = 60) were pre-screened for motion sickness susceptibility. Participants were then randomly assigned to either a control condition, focusing on environmental awareness, or to an experimental condition implementing paced DB. Following this, participants were exposed to a virtual reality (VR) motion sickness experience, while heart rate variability, breathing rate (RPM), and motion sickness ratings were collected. Results demonstrated participants in the DB condition had higher PNS activation and reported fewer motion sickness symptoms during the VR experience than the participants in the control condition. Results suggest that the DB protocol can be used to significantly increase PNS tone and decrease the development of motion sickness symptoms.", "date": "2014-10-04"}, {"link": "https://pdfs.semanticscholar.org/9925/cf9db475202754d68d45f99097a32bdc1d14.pdf", "title": "Results and Guidelines From a Repeated-Measures Design Experiment Comparing Standing and Seated Full-Body Gesture-Based Immersive Virtual Reality Exergames: Within-Subjects Evaluation", "authors": [{"firstName": "Wenge", "middleNames": [], "lastName": "Xu"}, {"firstName": "Hai-Ning", "middleNames": [], "lastName": "Liang"}, {"firstName": "Q.", "middleNames": [], "lastName": "He"}, {"firstName": "Xiang", "middleNames": [], "lastName": "Li"}, {"firstName": "Kangyou", "middleNames": [], "lastName": "Yu"}, {"firstName": "Yuzheng", "middleNames": [], "lastName": "Chen"}], "abstract": "Background Although full-body seated exercises have been studied in a wide range of settings (ie, homes, hospitals, and daycare centers), they have rarely been converted to seated exergames. In addition, there is an increasing number of studies on immersive virtual reality (iVR) full-body gesture-based standing exergames, but the suitability and usefulness of seated exergames remain largely unexplored. Objective This study aimed to evaluate the difference between playing a full-body gesture-based iVR standing exergame and seated exergame in terms of gameplay performance, intrinsic motivation, and motion sickness. Methods A total of 52 participants completed the experiment. The order of the game mode (standing and sitting) was counterbalanced. Gameplay performance was evaluated by action or gesture completion time and the number of missed gestures. Exertion was measured by the average heart rate (HR) percentage (AvgHR%), increased HR%, calories burned, and the Borg 6-20 questionnaire. Intrinsic motivation was assessed with the Intrinsic Motivation Inventory (IMI), whereas motion sickness was assessed via the Motion Sickness Assessment Questionnaire (MSAQ). In addition, we measured the fear of falling using a 10-point Likert scale questionnaire. Results Players missed more gestures in the seated exergame than in the standing exergame, but the overall miss rate was low (2.3/120, 1.9%). The analysis yielded significantly higher AvgHR%, increased HR%, calories burned, and Borg 6-20 rating of perceived exertion values for the seated exergame (all P<.001). The seated exergame was rated significantly higher on peripheral sickness (P=.02) and sopite-related sickness (MSAQ) (P=.004) than the standing exergame. The score of the subscale “value/usefulness” from IMI was reported to be higher for the seated exergame than the standing exergame. There was no significant difference between the seated exergame and standing exergame in terms of intrinsic motivation (interest/enjoyment, P=.96; perceived competence, P=.26; pressure/tension, P=.42) and the fear of falling (P=.25). Conclusions Seated iVR full-body gesture-based exergames can be valuable complements to standing exergames. Seated exergames have the potential to lead to higher exertion, provide higher value to players, and be more applicable in small spaces compared with standing exergames. However, gestures for seated exergames need to be designed carefully to minimize motion sickness, and more time should be given to users to perform gestures in seated exergames compared with standing exergames.", "date": "2020-07-27"}, {"link": "https://doi.org/10.1080/10803548.2015.1017964", "title": "Heart rate variability (HRV) during virtual reality immersion", "authors": [{"firstName": "M.", "middleNames": [], "lastName": "Malińska"}, {"firstName": "K.", "middleNames": [], "lastName": "Zużewicz"}, {"firstName": "J.", "middleNames": [], "lastName": "Bugajska"}, {"firstName": "A.", "middleNames": [], "lastName": "Grabowski"}], "abstract": "The goal of the study was assessment of the hour-long training involving handling virtual environment (sVR) and watching a stereoscopic 3D movie on the mechanisms of autonomic heart rate (HR) regulation among the subjects who were not predisposed to motion sickness. In order to exclude predispositions to motion sickness, all the participants (n=19) underwent a Coriolis test. During an exposure to 3D and sVR the ECG signal was continuously recorded using the Holter method. For the twelve consecutive 5-min epochs of ECG signal, the analysis of heart rate variability (HRV) in time and frequency domains was conducted. After 30 min from the beginning of the training in handling the virtual workstation a significant increase in LF spectral power was noted. The values of the sympathovagal LF/HF index while sVR indicated a significant increase in sympathetic predominance in four time intervals, namely between the 5th and the 10th minute, between the 15th and the 20th minute, between the 35th and 40th minute and between the 55th and the 60th minute of exposure.", "date": "2015-01-02"}]