[{"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7959130", "title": "Towards High-Quality Visualization of Superfluid Vortices", "authors": [{"firstName": "Yulong", "middleNames": [], "lastName": "Guo"}, {"firstName": "Xiaopei", "middleNames": [], "lastName": "Liu"}, {"firstName": "C.", "middleNames": [], "lastName": "Xiong"}, {"firstName": "Xuemiao", "middleNames": [], "lastName": "Xu"}, {"firstName": "C.", "middleNames": [], "lastName": "Fu"}], "abstract": "Superfluidity is a special state of matter exhibiting macroscopic quantum phenomena and acting like a fluid with zero viscosity. In such a state, superfluid vortices exist as phase singularities of the model equation with unique distributions. This paper presents novel techniques to aid the visual understanding of superfluid vortices based on the state-of-the-art non-linear Klein-Gordon equation, which evolves a complex scalar field, giving rise to special vortex lattice/ring structures with dynamic vortex formation, reconnection, and Kelvin waves, etc. By formulating a numerical model with theoretical physicists in superfluid research, we obtain high-quality superfluid flow data sets without noise-like waves, suitable for vortex visualization. By further exploring superfluid vortex properties, we develop a new vortex identification and visualization method: a novel mechanism with velocity circulation to overcome phase singularity and an orthogonal-plane strategy to avoid ambiguity. Hence, our visualizations can help reveal various superfluid vortex structures and enable domain experts for related visual analysis, such as the steady vortex lattice/ring structures, dynamic vortex string interactions with reconnections and energy radiations, where the famous Kelvin waves and decaying vortex tangle were clearly observed. These visualizations have assisted physicists to verify the superfluid model, and further explore its dynamic behavior more intuitively.", "date": "2017-10-07"}, {"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8370036", "title": "Photonic Microwave Waveforms Generation Based on Frequency and Time-Domain Synthesis", "authors": [{"firstName": "Tingwei", "middleNames": [], "lastName": "Wu"}, {"firstName": "C.", "middleNames": [], "lastName": "Zhang"}, {"firstName": "Heng", "middleNames": [], "lastName": "Zhou"}, {"firstName": "H.", "middleNames": [], "lastName": "Huang"}, {"firstName": "K.", "middleNames": [], "lastName": "Qiu"}], "abstract": "In this paper, a novel photonic microwave waveform generation method with both frequency-domain synthesis (FDS) and time-domain synthesis (TDS) is proposed, for the first time to the best of our knowledge, by using cascaded modulation and an optoelectronic oscillator. By controlling the spectral lines in a polarization-modulated optoelectronic oscillator (P-M-OEO), a triangular waveform is generated according to the FDS, where a parallel part of the optimum modulation axis of the Mach–Zehnder modulator (MZM) executes carrier suppression in the P-M-OEO, while its orthogonal part is left unmodulated. A quasi-rectangular waveform is then generated by directly modulating another MZM at the quadrature point. Additionally, a sawtooth or reversed-sawtooth waveform with 50% duty cycle and 100% duty cycle can be generated in TDS. In the experiment, a 3-GHz triangular waveform, a 3-GHz high-quality microwave signal, a 6-GHz frequency doubling signal, a 3-GHz quasi-rectangular waveform, a 3-GHz 50% duty cycle sawtooth or reversed-sawtooth waveform, and a 100% duty cycle sawtooth or reversed-sawtooth with frequency doubling are obtained simultaneously. The results verify the feasibility of the proposed scheme, and it holds a potential candidate for applications in photonic microwave signals."}, {"link": "https://arxiv.org/pdf/2101.02455.pdf", "title": "SuperMat: Construction of a linked annotated dataset from superconductors-related publications", "authors": [{"firstName": "Luca", "middleNames": [], "lastName": "Foppiano"}, {"firstName": "Sae", "middleNames": [], "lastName": "Dieb"}, {"firstName": "A.", "middleNames": [], "lastName": "Suzuki"}, {"firstName": "P.", "middleNames": [], "lastName": "Castro"}, {"firstName": "S.", "middleNames": [], "lastName": "Iwasaki"}, {"firstName": "Azusa", "middleNames": [], "lastName": "Uzuki"}, {"firstName": "Miren", "middleNames": ["Esparza"], "lastName": "Echevarria"}, {"firstName": "Y.", "middleNames": [], "lastName": "Meng"}, {"firstName": "K.", "middleNames": [], "lastName": "Terashima"}, {"firstName": "Laurent", "middleNames": [], "lastName": "Romary"}, {"firstName": "Y.", "middleNames": [], "lastName": "Takano"}, {"firstName": "Masashi", "middleNames": [], "lastName": "Ishii"}], "abstract": "A growing number of papers are published in the area of superconducting materials science. However, novel text and data mining (TDM) processes are still needed to efficiently access and exploit this accumulated knowledge, paving the way towards data-driven materials design. Herein, we present SuperMat (Superconductor Materials), an annotated corpus of linked data derived from scientific publications on superconductors, which comprises 142 articles, 16052 entities, and 1398 links that are characterised into six categories: the names, classes, and properties of materials; links to their respective superconducting critical temperature (Tc); and parametric conditions such as applied pressure or measurement methods. The construction of SuperMat resulted from a fruitful collaboration between computer scientists and material scientists, and its high quality is ensured through validation by domain experts. The quality of the annotation guidelines was ensured by satisfactory Inter Annotator Agreement (IAA) between the annotators and the domain experts. SuperMat includes the dataset, annotation guidelines, and annotation support tools that use automatic suggestions to help minimise human errors. Background & summary The vast majority of scientific knowledge exists as published articles [8, 15, 34, 1]. These publications are presented mainly as text, which is challenging to be 1 ar X iv :2 10 1. 02 45 5v 1 [ co nd -m at .s up rco n] 7 J an 2 02 1 used as a machine-readable structure. Meanwhile, as a part of the text and data mining (TDM) discipline, computer-assisted information collection from the literature has become a supportive asset for scientific research [33]. In the past decades, new TDM processes were developed for several natural science disciplines to achieve automatic document processing such as information retrieval, entity extraction, and clustering. TDM has been applied in biology for identifing interactions between agents (e.g. bacteria, viruses, genes, and proteins) [11, 23, 22] to support the research on serious diseases including cancer [25]. In chemistry, it was used for the disambiguation of chemical compounds names, synthesis extraction, and retrieval [10]. In both domains, the application of TDM was based on manually curated datasets (corpora) that functioned as infrastructures. Examples are the BioCreative IV CHEMDNER corpus [24] in chemistry, and Genia [16] and GENETAG [37, 32] in biology. Such datasets are crucial for developing, training, and evaluating TDM systems. In comparison, such resources in the materials science domain are rather limited. Reported cases include NaDev [3] on nanocrystal devices research, SC-CoMIcs [38] in the superconductors domain, and a corpus for extracting synthesis recipes [20]. To address this shortage of infrastructure, experimental data is extracted manually [7], or ab-initio calculations are used [13] but they might not accurately describe the real system. Several challenges still hinder the data-driven exploration of materials (also called Materials Informatics (MI)), namely: the lack of data standard, infant stage of the data-driven culture, a wide variety of conflicting stakeholders, and missing incentives for researchers to contribute to large collaborative initiatives [12]. To bridge these gaps, it is necessary to create infrastructural resources to support TDM processes in materials science through the automatic construction of databases for materials and their properties. Such application can minimise the need for humans to read the new papers and extract the key information therein. Equally importantly, it enables scientists to focus and leverage computing power and human resources to find deeper relationships between superficially unrelated information. Other applications include providing semantically enriched search engines that accept fine-grain queries [28] to reduce the time needed to access specific information. These processes cannot be established without essential resources such as dictionaries, lexicons, and datasets. Research on superconducting materials has been growing rapidly towards both fundamental science as well as practical applications. Superconductors display many intriguing phenomena including zero-resistivity, the ability to host a high magnetic field, quantisation of the magnetic flux, and vortex pinning. Current applications of superconductors include medical instruments, high-speed trains, quantum computers, and the Linear Hadron Collider (LHC) [29, 17, 2]. However, discovering a new superconductor is a challenging task, as only 3% of candidate materials were found to be superconductors [19]. The National Institute for Materials Science (NIMS) in Japan has been manually constructing databases to support material research, and SuperCon (http://supercon. nims.go.jp) is a manually curated data source for the superconductor domain. These databases would help researchers design new superconducting materials with a higher superconducting critical temperature (Tc) (ideally up to room temperature) [9, 36]. However, the current resources are very limited and not dynamic enough to incorporate the information from new publications in a timely manner. In this paper, we present SuperMat (Superconductors Mate-", "date": "2021-01-07"}, {"link": "https://arxiv.org/pdf/1811.01239.pdf", "title": "Modern data analytics approach to predict creep of high-temperature alloys", "authors": [{"firstName": "Dongwon", "middleNames": [], "lastName": "Shin"}, {"firstName": "Y.", "middleNames": [], "lastName": "Yamamoto"}, {"firstName": "M.", "middleNames": [], "lastName": "Brady"}, {"firstName": "S.", "middleNames": [], "lastName": "Lee"}, {"firstName": "J.", "middleNames": [], "lastName": "Haynes"}], "abstract": "Abstract A breakthrough in alloy design often requires comprehensive understanding in complex multi-component/multi-phase systems to generate novel material hypotheses. We introduce a modern data analytics workflow that leverages high-quality experimental data augmented with advanced features obtained from high-fidelity models. Herein, we use an example of a consistently-measured creep dataset of developmental high-temperature alloy combined with scientific alloy features populated from a high-throughput computational thermodynamic approach. Extensive correlation analyses provide ranking insights for most impactful alloy features for creep resistance, evaluated from a large set of candidate features suggested by domain experts. We also show that we can accurately train machine learning models by integrating high-ranking features obtained from correlation analyses. The demonstrated approach can be extended beyond incorporating thermodynamic features, with input from domain experts used to compile lists of features from other alloy physics, such as diffusion kinetics and microstructure evolution.", "date": "2018-11-03"}, {"link": "https://www.ncbi.nlm.nih.gov/pubmed/32902453", "title": "Self-reference method for measuring the transmission matrices of scattering media.", "authors": [{"firstName": "H.", "middleNames": [], "lastName": "Zhang"}, {"firstName": "B.", "middleNames": [], "lastName": "Zhang"}, {"firstName": "Qi", "middleNames": [], "lastName": "Feng"}, {"firstName": "Y.", "middleNames": [], "lastName": "Ding"}, {"firstName": "Q.", "middleNames": [], "lastName": "Liu"}], "abstract": "A significant approach for manipulating light propagation through scattering media consists of the measurement of transmission matrices (TMs). Here we propose a TM-measurement method with high stability and universal applicability, which we call the self-reference method. This method uses a new, to the best of our knowledge, way to perform holographic measurement, where the reference light is superimposed directly to the signal light. This method does not pose any restriction on the signal light, so it is applicable to nearly all types of input bases. The effectivity of this method in accurately measuring the TM is verified by experimentally achieving high-quality light focusing through a scattering medium. We believe that the self-reference method provides an ideal way for TM measurement and wavefront shaping, which will be of great significance to imaging and communication technologies in scattering environments.", "date": "2020-09-01"}]