[{"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8731487", "title": "Towards the Completion of a Domain-Specific Knowledge Base with Emerging Query Terms", "authors": [{"firstName": "S.", "middleNames": [], "lastName": "Jiang"}, {"firstName": "Jiaqing", "middleNames": [], "lastName": "Liang"}, {"firstName": "Y.", "middleNames": [], "lastName": "Xiao"}, {"firstName": "Haihong", "middleNames": [], "lastName": "Tang"}, {"firstName": "Haikuan", "middleNames": [], "lastName": "Huang"}, {"firstName": "Jun", "middleNames": [], "lastName": "Tan"}], "abstract": "Domain-specific knowledge bases play an increasingly important role in a variety of real applications. In this paper, we use the product knowledge base in the largest Chinese e-commerce platform, Taobao, as an example to investigate a completion procedure of a domain-specific knowledge base. We argue that the domain-specific knowledge bases tend to be incomplete, and are oblivious to their incompleteness, without a continuous completion procedure in place. The key component of this completion procedure is the classification of emerging query terms into corresponding properties of categories in existing taxonomy. Our proposal is that we use query logs to complete the product knowledge base of Taobao. However, the query driven completion usually faces many challenges including distinguishing the fine-grained semantic of unrecognized terms, handling the sparse data and so on. We propose a graph based solution to overcome these challenges. We first construct a lot of positive evidence to establish the semantical similarity between terms, and then run a shortest path or alternatively a random walk on the similarity graph under a set of constraints derived from a set of negative evidence to find the best candidate property for emerging query terms. We finally conduct extensive experiments on real data of Taobao and a subset of CN-DBpedia. The results show that our solution classifies emerging query terms with a good performance. Our solution is already deployed in Taobao, helping it find nearly 7 million new values for properties. The complete product knowledge base significantly improves the ratio of recognized queries and recognized terms by more than 25% and 32%, respectively.", "date": "2019-04-08"}, {"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=8482023", "title": "Natural Language Interfaces to Domain Specific Knowledge Bases: An Illustration for Querying Elements of the Periodic Table", "authors": [{"firstName": "M.", "middleNames": ["K."], "lastName": "Rohil"}, {"firstName": "Rohan", "middleNames": ["Kumar"], "lastName": "Rohil"}, {"firstName": "Divyesakshi", "middleNames": [], "lastName": "Rohil"}, {"firstName": "Anurag", "middleNames": [], "lastName": "Runthala"}], "abstract": "The task of providing Natural Language Interface (NLI) to any domain specific knowledge base is much demanding despite (potentially) favorable factors like low volume of vocabulary, unambiguous and precise meaning of words, less number of relations among the entities, etc. The simplification of this task has been proposed and presented in this research. The authors have made a successful effort to develop an NLI system to answer the user's simple queries (in English) about the properties of chemical elements and their grouping in the Periodic Table. Adding to the ease, the user is not required to know anything about the structure of the knowledge base of the elements, since the software is implemented (using Logic Programming constructs) in Prolog wherein program and data are treated indistinguishably. Firstly, the system accepts a query and subsequently, it can analyze and understand the query, if the query contains all words within the domain specific vocabulary. Finally, it efficiently searches the knowledge base to answer the query, by reducing search space using artificial intelligence techniques (like symbolic manipulation). If the query is not understood by the system, it reports to the user the words not available in the knowledge base and the particular relations among the entities which could not be set. The knowledge base (~150 KB) contains the properties of chemical elements, their arrangement in Periodic Table and the inter-relationships among these properties. In a nutshell, the research suggests that to develop an NLI to a domain specific knowledge base, it is better to develop a parser capable of handling the entities and their interrelationships as understood in the domain; hence, only little is to be coded for the various grammars, languages, transition networks, etc.", "date": "2018-07-01"}, {"link": "https://pdfs.semanticscholar.org/37a4/57fbd16718eece8906ef582bdbd5892cbb80.pdf", "title": "Creation and Interaction with Large-scale Domain-Specific Knowledge Bases", "authors": [{"firstName": "Shreyas", "middleNames": [], "lastName": "Bharadwaj"}, {"firstName": "Laura", "middleNames": [], "lastName": "Chiticariu"}, {"firstName": "Marina", "middleNames": [], "lastName": "Danilevsky"}, {"firstName": "Samarth", "middleNames": [], "lastName": "Dhingra"}, {"firstName": "Samved", "middleNames": [], "lastName": "Divekar"}, {"firstName": "Arnaldo", "middleNames": [], "lastName": "Carreno-Fuentes"}, {"firstName": "H.", "middleNames": [], "lastName": "Gupta"}, {"firstName": "N.", "middleNames": [], "lastName": "Gupta"}, {"firstName": "Sang-Don", "middleNames": [], "lastName": "Han"}, {"firstName": "M.", "middleNames": [], "lastName": "Hernández"}, {"firstName": "C.", "middleNames": [], "lastName": "Ho"}, {"firstName": "Parag", "middleNames": [], "lastName": "Jain"}, {"firstName": "S.", "middleNames": [], "lastName": "Joshi"}, {"firstName": "Hima", "middleNames": [], "lastName": "Karanam"}, {"firstName": "S.", "middleNames": [], "lastName": "Krishnan"}, {"firstName": "R.", "middleNames": [], "lastName": "Krishnamurthy"}, {"firstName": "Yunyao", "middleNames": [], "lastName": "Li"}, {"firstName": "S.", "middleNames": [], "lastName": "Manivannan"}, {"firstName": "Ashish", "middleNames": ["R."], "lastName": "Mittal"}, {"firstName": "Fatma", "middleNames": [], "lastName": "Özcan"}, {"firstName": "A.", "middleNames": [], "lastName": "Quamar"}, {"firstName": "P.", "middleNames": [], "lastName": "Raman"}, {"firstName": "Diptikalyan", "middleNames": [], "lastName": "Saha"}, {"firstName": "K.", "middleNames": [], "lastName": "Sankaranarayanan"}, {"firstName": "Jaydeep", "middleNames": [], "lastName": "Sen"}, {"firstName": "P.", "middleNames": [], "lastName": "Sen"}, {"firstName": "Shivakumar", "middleNames": [], "lastName": "Vaithyanathan"}, {"firstName": "M.", "middleNames": [], "lastName": "Vasa"}, {"firstName": "H.", "middleNames": [], "lastName": "Wang"}, {"firstName": "Huaiyu", "middleNames": [], "lastName": "Zhu"}], "abstract": "The ability to create and interact with large-scale domain-specific knowledge bases from unstructured/semi-structured data is the foundation for many industry-focused cognitive systems. We will demonstrate the Content Services system that provides cloud services for creating and querying high-quality domain-specific knowledge bases by analyzing and integrating multiple (un/semi)structured content sources. We will showcase an instantiation of the system for a financial domain. We will also demonstrate both cross-lingual natural language queries and programmatic API calls for interacting with this knowledge base.", "date": "2017-08-01"}, {"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7373339", "title": "Domain-Specific Knowledge Base Enrichment Using Wikipedia Tables", "authors": [{"firstName": "Chenwei", "middleNames": [], "lastName": "Ran"}, {"firstName": "Wei", "middleNames": [], "lastName": "Shen"}, {"firstName": "Jianyong", "middleNames": [], "lastName": "Wang"}, {"firstName": "Xuan", "middleNames": [], "lastName": "Zhu"}], "abstract": "The knowledge base is a machine-readable set of knowledge. More and more multi-domain and large-scale knowledge bases have emerged in recent years, and they play an essential role in many information systems and semantic annotation tasks. However we do not have a perfect knowledge base yet and maybe we will never have a perfect one, because all the knowledge bases have limited coverage while new knowledge continues to emerge. Therefore populating and enriching the existing knowledge base become important tasks. Traditional knowledge base population task usually leverages the information embedded in the unstructured free text. Recently researchers found that massive structured tables on the Web are high-quality relational data and easier to be utilized than the unstructured text. Our goal of this paper is to enrich the knowledge base using Wikipedia tables. Here, knowledge means binary relations between entities and we focus on the relations in some specific domains. There are two basic types of information can be used in this task: the existing relation instances and the connection between types and relations. We firstly propose two basic probabilistic models based on two types of information respectively. Then we propose a light-weight aggregated model to combine the advantages of basic models. The experimental results show that our method is an effective approach to enriching the knowledge base with both high precision and recall.", "date": "2015-11-14"}, {"link": "http://ieeexplore.ieee.org/stamp/stamp.jsp?tp=&arnumber=7726146", "title": "An Automatic and General Framework for Domain-Specific Knowledge Bases Extracting", "authors": [{"firstName": "Kejun", "middleNames": [], "lastName": "Deng"}, {"firstName": "Hongjie", "middleNames": [], "lastName": "Fan"}, {"firstName": "J.", "middleNames": [], "lastName": "Liu"}], "abstract": "A domain-specific knowledge base (KB), as the name implies, contains concepts, instances, and relationships of a relatively well-defined domain. In recent years, domain-specific KBs are increasingly found to be critical and effective to a wide variety of real-world applications. However, less attention has been paid to the creation of domain-specific KBs compared with global KBs. In this paper we present an automatic and general framework for domain-specific KBs extraction. As KBs creation is a time-consuming task, our framework extracts domain-specific KBs from existing public global KBs. In particular, we use a semantic lexicon to capture domain information from user input keywords. During the process, we provide four rules to assure the semantic consistency and semantic completeness features of the extracted domain-specific KBs. Extensive experiments on the real dataset have been conducted to verify the effectiveness and efficiency of our approach.", "date": "2016-07-08"}]