[{"link": "https://www.ncbi.nlm.nih.gov/pubmed/33338203", "title": "MuscleAtlasExplorer: a web service for studying gene expression in human skeletal muscle", "authors": [{"firstName": "Olof", "middleNames": [], "lastName": "Asplund"}, {"firstName": "J.", "middleNames": [], "lastName": "Rung"}, {"firstName": "L.", "middleNames": [], "lastName": "Groop"}, {"firstName": "B.", "middleNames": [], "lastName": "RashmiPrasad"}, {"firstName": "O.", "middleNames": [], "lastName": "Hansson"}], "abstract": "Abstract MuscleAtlasExplorer is a freely available web application that allows for the exploration of gene expression data from human skeletal muscle. It draws from an extensive publicly available dataset of 1654 skeletal muscle expression microarray samples. Detailed, manually curated, patient phenotype data, with information such as age, sex, BMI and disease status, are combined with skeletal muscle gene expression to provide insights into gene function in skeletal muscle. It aims to facilitate easy exploration of the data using powerful data visualization functions, while allowing for sample selection, in-depth inspection and further analysis using external tools. Availability: MuscleAtlasExplorer is available at https://mae.crc.med.lu.se/mae2 (username ‘muscle’ and password ‘explorer’ pre-publication).", "date": "2020-12-18"}, {"link": "https://doi.org/10.1101/684225", "title": "Tensor decomposition-Based Unsupervised Feature Extraction Applied to Single-Cell Gene Expression Analysis", "authors": [{"firstName": "Y-h.", "middleNames": [], "lastName": "Taguchi"}, {"firstName": "Turki", "middleNames": [], "lastName": "Turki"}], "abstract": "Although single cell RNA sequencing (scRNA-seq) technology is newly invented and promising one, because of lack of enough information that labels individual cells, it is hard to interpret the obtained gene expression of each cell. Because of this insufficient information available, unsupervised clustering, e.g., t-Distributed Stochastic Neighbor Embedding and Uniform Manifold Approximation and Projection, is usually employed to obtain low dimensional embedding that can help to understand cell-cell relationship. One possible drawback of this strategy is that the outcome is highly dependent upon genes selected for the usage of clustering. In order to fulfill this requirement, there are many methods that performed unsupervised gene selection. In this study, a tensor decomposition (TD) based unsupervised feature extraction (FE) was applied to the integration of two scRNA-seq expression profiles that measure human and mouse midbrain development. TD based unsupervised FE could not only select coincident genes between human and mouse, but also biologically reliable genes. Coincidence between two species as well as biological reliability of selected genes is increased compared with principal component analysis (PCA) based FE applied to the same data set in the previous study. Since PCA based unsupervised FE outperformed other three popular unsupervised gene selection methods, highly variable genes, bimodal genes and dpFeature, TD based unsupervised FE can do so as well. In addition to this, ten transcription factors (TFs) that might regulate selected genes and might contribute to midbrain development are identified. These ten TFs, BHLHE40, EGR1, GABPA, IRF3, PPARG, REST, RFX5, STAT3, TCF7L2, and ZBTB33, were previously reported to be related to brain functions and diseases. TD based unsupervised FE is a promising method to integrate two scRNA-seq profiles effectively.", "date": "2019-08-09"}, {"link": "https://pdfs.semanticscholar.org/90f4/80003016bb8c1724d784752dcaae31dc3a26.pdf", "title": "Tensor Decomposition-Based Unsupervised Feature Extraction Applied to Single-Cell Gene Expression Analysis", "authors": [{"firstName": "Y-h.", "middleNames": [], "lastName": "Taguchi"}, {"firstName": "Turki", "middleNames": [], "lastName": "Turki"}], "abstract": "Although single-cell RNA sequencing (scRNA-seq) technology is newly invented and a promising one, but because of lack of enough information that labels individual cells, it is hard to interpret the obtained gene expression of each cell. Because of insufficient information available, unsupervised clustering, for example, t-distributed stochastic neighbor embedding and uniform manifold approximation and projection, is usually employed to obtain low-dimensional embedding that can help to understand cell–cell relationship. One possible drawback of this strategy is that the outcome is highly dependent upon genes selected for the usage of clustering. In order to fulfill this requirement, there are many methods that performed unsupervised gene selection. In this study, a tensor decomposition (TD)-based unsupervised feature extraction (FE) was applied to the integration of two scRNA-seq expression profiles that measure human and mouse midbrain development. TD-based unsupervised FE could select not only coincident genes between human and mouse but also biologically reliable genes. Coincidence between two species as well as biological reliability of selected genes is increased compared with that using principal component analysis (PCA)-based FE applied to the same data set in the previous study. Since PCA-based unsupervised FE outperformed the other three popular unsupervised gene selection methods, highly variable genes, bimodal genes, and dpFeature, TD-based unsupervised FE can do so as well. In addition to this, 10 transcription factors (TFs) that might regulate selected genes and might contribute to midbrain development were identified. These 10 TFs, BHLHE40, EGR1, GABPA, IRF3, PPARG, REST, RFX5, STAT3, TCF7L2, and ZBTB33, were previously reported to be related to brain functions and diseases. TD-based unsupervised FE is a promising method to integrate two scRNA-seq profiles effectively.", "date": "2019-09-19"}, {"link": "https://doi.org/10.1007/978-3-030-35653-8_17", "title": "A Combined Enhancing and Feature Extraction Algorithm to Improve Learning Accuracy for Gene Expression Classification", "authors": [{"firstName": "Phuoc-Hai", "middleNames": [], "lastName": "Huynh"}, {"firstName": "Van", "middleNames": ["Hoa"], "lastName": "Nguyen"}, {"firstName": "T.", "middleNames": [], "lastName": "Do"}], "abstract": "In recent years, gene expression data combined with machine learning methods revolutionized cancer classification which had been based solely on morphological appearance. However, the characteristics of gene expression data have very-high-dimensional and small-sample-size which lead to over-fitting of classification algorithms. We propose a novel gene expression classification model of multiple classifying algorithms with synthetic minority oversampling technique (SMOTE) using features extracted by deep convolutional neural network (DCNN). In our approach, the DCNN extracts latent features of gene expression data, then the SMOTE algorithm generates new data from the features of DCNN was implemented. These models are used in conjunction with classifiers that efficiently classify gene expression data. Numerical test results on fifty very-high-dimensional and small-sample-size gene expression datasets from the Kent Ridge Biomedical and Array Expression repositories illustrate that the proposed algorithm is more accurate than state-of-the-art classifying models and improve the accuracy of classifiers including non-linear support vector machines (SVM), linear SVM, k nearest neighbors and random forests.", "date": "2019-11-27"}, {"link": "https://doi.org/10.1186/s12859-018-2395-8", "title": "Drug candidate identification based on gene expression of treated cells using tensor decomposition-based unsupervised feature extraction for large-scale data", "authors": [{"firstName": "Y.", "middleNames": [], "lastName": "Taguchi"}], "abstract": "BackgroundAlthough in silico drug discovery is necessary for drug development, two major strategies, a structure-based and ligand-based approach, have not been completely successful. Currently, the third approach, inference of drug candidates from gene expression profiles obtained from the cells treated with the compounds under study requires the use of a training dataset. Here, the purpose was to develop a new approach that does not require any pre-existing knowledge about the drug–protein interactions, but these interactions can be inferred by means of an integrated approach using gene expression profiles obtained from the cells treated with the analysed compounds and the existing data describing gene–gene interactions.ResultsIn the present study, using tensor decomposition-based unsupervised feature extraction, which represents an extension of the recently proposed principal-component analysis-based feature extraction, gene sets and compounds with a significant dose-dependent activity were screened without any training datasets. Next, after these results were combined with the data showing perturbations in single-gene expression profiles, genes targeted by the analysed compounds were inferred. The set of target genes thus identified was shown to significantly overlap with known target genes of the compounds under study.ConclusionsThe method is specifically designed for large-scale datasets (including hundreds of treatments with compounds), not for conventional small-scale datasets. The obtained results indicate that two compounds that have not been extensively studied, WZ-3105 and CGP-60474, represent promising drug candidates targeting multiple cancers, including melanoma, adenocarcinoma, liver carcinoma, and breast, colon, and prostate cancers, which were analysed in this in silico study.", "date": "2019-02-04"}]